zephyrproject-rtos/hal_nxp/mcux/mcux-sdk/devices/MCXA276/drivers/fsl_clock.c
/*! brief  Return Frequency of core
 *  return Frequency of the core
 */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    return CLOCK_GetMainClk() / ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) + 1U);
}

/* Get I3C Clk */
/*! brief  Return Frequency of I3C Clock
 *  return Frequency of I3C Clock
 */
uint32_t CLOCK_GetI3CFClkFreq(void)
{
    uint32_t freq   = 0U;
    uint32_t clksel = (MRCC0->MRCC_I3C0_FCLK_CLKSEL);
    uint32_t clkdiv = (MRCC0->MRCC_I3C0_FCLK_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/* Get CTimer Clk */
/*! brief  Return Frequency of CTimer functional Clock
 *  return Frequency of CTimer functional Clock
 */
uint32_t CLOCK_GetCTimerClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_CTIMER0_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_CTIMER1_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_CTIMER2_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_CTIMER3_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_CTIMER4_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER4_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_CTIMER0_CLKSEL;
            clkdiv = MRCC0->MRCC_CTIMER0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 1U:
            freq = CLOCK_GetFroHfFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 4U:
            freq = CLOCK_GetClk16KFreq(1);
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/* Get LPI2C Clk */
/*! brief  Return Frequency of LPI2C functional Clock
 *  return Frequency of LPI2C functional Clock
 */
uint32_t CLOCK_GetLpi2cClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_LPI2C0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_LPI2C1_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_LPI2C2_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_LPI2C3_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C3_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_LPI2C0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPI2C0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of LPSPI Clock
 *  return Frequency of LPSPI Clock
 */
uint32_t CLOCK_GetLpspiClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = (0U == id) ? (MRCC0->MRCC_LPSPI0_CLKSEL) : (MRCC0->MRCC_LPSPI1_CLKSEL);
    uint32_t clkdiv = (0U == id) ? (MRCC0->MRCC_LPSPI0_CLKDIV) : (MRCC0->MRCC_LPSPI1_CLKDIV);

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

    switch (clksel)
    {
        case 0U:
            freq = CLOCK_GetFroLfDivFreq();
            break;
        case 2U:
            freq = CLOCK_GetFroHfDivFreq();
            break;
        case 3U:
            freq = CLOCK_GetExtClkFreq();
            break;
        case 5U:
            freq = CLOCK_GetClk1MFreq();
            break;
        case 6U:
            freq = CLOCK_GetPll1ClkDivFreq();
            break;
        default:
            freq = 0U;
            break;
    }

    return freq / ((clkdiv & 0xFFU) + 1U);
}

/*! brief  Return Frequency of LPUART Clock
 *  return Frequency of LPUART Clock
 */
uint32_t CLOCK_GetLpuartClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clksel = 0U;
    uint32_t clkdiv = 0U;

    switch (id)
    {
        case 0U:
            clksel = MRCC0->MRCC_LPUART0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART0_CLKDIV;
            break;
        case 1U:
            clksel = MRCC0->MRCC_LPUART1_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART1_CLKDIV;
            break;
        case 2U:
            clksel = MRCC0->MRCC_LPUART2_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART2_CLKDIV;
            break;
        case 3U:
            clksel = MRCC0->MRCC_LPUART3_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART3_CLKDIV;
            break;
        case 4U:
            clksel = MRCC0->MRCC_LPUART4_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART4_CLKDIV;
            break;
        case 5U:
            clksel = MRCC0->MRCC_LPUART5_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART5_CLKDIV;
            break;
        default:
            clksel = MRCC0->MRCC_LPUART0_CLKSEL;
            clkdiv = MRCC0->MRCC_LPUART0_CLKDIV;
            break;
    }

    if (true == CLOCK_IsDivHalt(clkdiv))
    {
        return 0;
    }

